# Анализ сервиса для чтения книг

**Задачи**
- Посчитайть количество книг вышедших после 1 января 2000 года;
- Для каждой книги посчитать количество обзоров и среднюю оценку;
- Определить издательство, которое выпустило наибольшее число книг толще 50 страниц (исключение брошюр из анализа);
- Определить автора с самой высокой средней оценкой книг (учитываются только книги с 50 и более оценками);
- Посчитайть среднее количество обзоров от пользователей, которые поставили больше 50 оценок.

**Настройка окружения**

In [1]:
import pandas as pd
from sqlalchemy import create_engine
# импорт библиотек

In [2]:
db_config = {'user': 'praktikum_student', # имя пользователя
             'pwd': 'Sdf4$2;d-d30pp', # пароль
             'host': 'rc1b-wcoijxj3yxfsf3fs.mdb.yandexcloud.net',
             'port': 6432, # порт подключения
             'db': 'data-analyst-final-project-db'} # название базы данных
# установка параметров

connection_string = 'postgresql://{}:{}@{}:{}/{}'.format(db_config['user'],
                                                         db_config['pwd'],
                                                         db_config['host'],
                                                         db_config['port'],
                                                         db_config['db'])
# строка соединения с БД

engine = create_engine(connection_string, connect_args={'sslmode':'require'})
# сохранение коннектора

## Первичное знакомство с данными

In [3]:
def first_view(table):
    q=pd.io.sql.read_sql('''SELECT * FROM {}'''.format(table), con = engine)
    display(q)
    print()
    display(q.info())
    print()
    display(q.describe())    
# Функция для просмотра основной информации по датасетам

**books**

In [4]:
first_view('books')

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268
...,...,...,...,...,...,...
995,996,571,Wyrd Sisters (Discworld #6; Witches #2),265,2001-02-06,147
996,997,454,Xenocide (Ender's Saga #3),592,1996-07-15,297
997,998,201,Year of Wonders,358,2002-04-30,212
998,999,94,You Suck (A Love Story #2),328,2007-01-16,331
999,1000,509,Zen and the Art of Motorcycle Maintenance: An ...,540,2006-04-25,143

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   book_id           1000 non-null   int64
 1   author_id         1000 non-null   int64
 2   title             1000 non-null   object
 3   num_pages         1000 non-null   int64
 4   publication_date  1000 non-null   object
 5   publisher_id      1000 non-null   int64
dtypes: int64(4), object(2)
memory usage: 47.0+ KB

None

           book_id    author_id   num_pages  publisher_id
count  1000.000000  1000.000000  1000.00000   1000.000000
mean    500.500000   320.417000   389.11100    171.270000
std     288.819436   181.620172   229.39014     99.082685
min       1.000000     1.000000    14.00000      1.000000
25%     250.750000   162.750000   249.00000     83.000000
50%     500.500000   316.500000   352.00000    177.500000
75%     750.250000   481.000000   453.00000    258.000000
max    1000.000000   636.000000  2690.00000    340.000000

**authors**

In [5]:
first_view('authors')

     author_id                                author
0            1                            A.S. Byatt
1            2        Aesop/Laura Harris/Laura Gibbs
2            3                       Agatha Christie
3            4                         Alan Brennert
4            5              Alan Moore/David   Lloyd
..         ...                                   ...
631        632         William Strunk Jr./E.B. White
632        633                           Zadie Smith
633        634                 Zilpha Keatley Snyder
634        635                    Zora Neale Hurston
635        636  Åsne Seierstad/Ingrid Christopherson

[636 rows x 2 columns]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 636 entries, 0 to 635
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   author_id  636 non-null    int64
 1   author     636 non-null    object
dtypes: int64(1), object(1)
memory usage: 10.1+ KB

None

        author_id
count  636.000000
mean   318.500000
std    183.741666
min      1.000000
25%    159.750000
50%    318.500000
75%    477.250000
max    636.000000

**publishers**

In [6]:
first_view('publishers')

     publisher_id                          publisher
0               1                                Ace
1               2                           Ace Book
2               3                          Ace Books
3               4                      Ace Hardcover
4               5  Addison Wesley Publishing Company
..            ...                                ...
335           336         Workman Publishing Company
336           337                         Wyatt Book
337           338              Yale University Press
338           339                           Yearling
339           340                     Yearling Books

[340 rows x 2 columns]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   publisher_id  340 non-null    int64
 1   publisher     340 non-null    object
dtypes: int64(1), object(1)
memory usage: 5.4+ KB

None

       publisher_id
count    340.000000
mean     170.500000
std       98.293777
min        1.000000
25%       85.750000
50%      170.500000
75%      255.250000
max      340.000000

**ratings**

In [7]:
first_view('ratings')

      rating_id  book_id        username  rating
0             1        1      ryanfranco       4
1             2        1   grantpatricia       2
2             3        1    brandtandrea       5
3             4        2        lorichen       3
4             5        2     mariokeller       2
...         ...      ...             ...     ...
6451       6452     1000  carolrodriguez       4
6452       6453     1000         wendy18       4
6453       6454     1000      jarvispaul       5
6454       6455     1000           zross       2
6455       6456     1000         fharris       5

[6456 rows x 4 columns]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6456 entries, 0 to 6455
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   rating_id  6456 non-null   int64
 1   book_id    6456 non-null   int64
 2   username   6456 non-null   object
 3   rating     6456 non-null   int64
dtypes: int64(3), object(1)
memory usage: 201.9+ KB

None

         rating_id      book_id       rating
count  6456.000000  6456.000000  6456.000000
mean   3228.500000   510.574195     3.928284
std    1863.831001   284.141636     0.943303
min       1.000000     1.000000     1.000000
25%    1614.750000   291.000000     3.000000
50%    3228.500000   506.000000     4.000000
75%    4842.250000   750.000000     5.000000
max    6456.000000  1000.000000     5.000000

**reviews**

In [8]:
first_view('reviews')

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...
3,4,3,johnsonamanda,Finally month interesting blue could nature cu...
4,5,3,scotttamara,Nation purpose heavy give wait song will. List...
...,...,...,...,...
2788,2789,999,martinadam,Later hospital turn easy community. Fact same ...
2789,2790,1000,wknight,Change lose answer close pressure. Spend so now.
2790,2791,1000,carolrodriguez,Authority go who television entire hair guy po...
2791,2792,1000,wendy18,Or western offer wonder ask. More hear phone f...
2792,2793,1000,jarvispaul,Republican staff bit eat material measure plan...

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2793 entries, 0 to 2792
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   review_id  2793 non-null   int64
 1   book_id    2793 non-null   int64
 2   username   2793 non-null   object
 3   text       2793 non-null   object
dtypes: int64(2), object(2)
memory usage: 87.4+ KB

None

         review_id      book_id
count  2793.000000  2793.000000
mean   1397.000000   504.693161
std     806.413976   288.472931
min       1.000000     1.000000
25%     699.000000   259.000000
50%    1397.000000   505.000000
75%    2095.000000   753.000000
max    2793.000000  1000.000000

## Анализ данных

### Количество книг, вышедших после 1 января 2000 года

In [9]:
query = ''' 
            SELECT
                COUNT(book_id) AS books_cnt
            FROM 
                books
            WHERE 
                publication_date > '2000-01-01'
        '''

In [10]:
pd.io.sql.read_sql(query, con = engine)

   books_cnt
0        819

### Количество обзоров и средняя оценка

In [11]:
query = '''
            SELECT 
                books.title,
                COUNT(distinct reviews.review_id) AS reviews_cnt,
                AVG(ratings.rating) AS avg_rating
            FROM
                books
            LEFT JOIN 
                ratings ON ratings.book_id = books.book_id
            LEFT JOIN 
                reviews ON reviews.book_id = books.book_id
            GROUP BY
                books.book_id
            ORDER BY
                COUNT(reviews.review_id) DESC
        '''

In [12]:
pd.io.sql.read_sql(query, con = engine)

,title,reviews_cnt,avg_rating
0,Twilight (Twilight #1),7,3.662500
1,The Hobbit or There and Back Again,6,4.125000
2,The Catcher in the Rye,6,3.825581
3,Harry Potter and the Prisoner of Azkaban (Harr...,6,4.414634
4,Harry Potter and the Chamber of Secrets (Harry...,6,4.287500
...,...,...,...
995,Essential Tales and Poems,0,4.000000
996,Leonardo's Notebooks,0,4.000000
997,The Cat in the Hat and Other Dr. Seuss Favorites,0,5.000000
998,Anne Rice's The Vampire Lestat: A Graphic Novel,0,3.666667
999,The Natural Way to Draw,0,3.000000

### Издательство, которое выпустило наибольшее число книг толще 50 страниц

In [13]:
query = '''
            SELECT
                publisher,
                COUNT(book_id) AS books_cnt
            FROM
                publishers
            LEFT JOIN
                books ON  books.publisher_id = publishers.publisher_id 
            WHERE
                num_pages > 50
            GROUP BY
                publisher
            ORDER BY
                books_cnt DESC
        '''

In [14]:
pd.io.sql.read_sql(query, con = engine)

                                             publisher  books_cnt
0                                        Penguin Books         42
1                                              Vintage         31
2                             Grand Central Publishing         25
3                                     Penguin Classics         24
4                                     Ballantine Books         19
..                                                 ...        ...
329                                         Turtleback          1
330  Atheneum Books for Young Readers: Richard Jack...          1
331                                     Penguin Signet          1
332                                    Victor Gollancz          1
333                      Harvard Business Review Press          1

[334 rows x 2 columns]

### Автор с самой высокой средней оценкой книг с учетом книг с 50 и более оценками

In [15]:
query = '''
            SELECT
                author,
                AVG(sub.avg_rating) AS high_avg_rating
            FROM
                (SELECT
                    author,
                    books.book_id,
                    AVG(rating) AS avg_rating
                 FROM
                     authors
                 LEFT JOIN 
                     books ON books.author_id = authors.author_id
                 LEFT JOIN 
                     ratings ON ratings.book_id = books.book_id
                 GROUP BY
                     author,
                     books.book_id
                 HAVING
                     COUNT(rating) > 50) AS sub
            GROUP BY
                author
            ORDER BY
                high_avg_rating DESC
        '''

In [16]:
pd.io.sql.read_sql(query, con = engine)

                                               author  high_avg_rating
0                          J.K. Rowling/Mary GrandPré         4.283844
1                   Markus Zusak/Cao Xuân Việt Khương         4.264151
2                                      J.R.R. Tolkien         4.258446
3                                   Louisa May Alcott         4.192308
4                                        Rick Riordan         4.080645
5                                     William Golding         3.901408
6                                       J.D. Salinger         3.825581
7            Paulo Coelho/Alan R. Clarke/Özdemir İnce         3.789474
8   William Shakespeare/Paul Werstine/Barbara A. M...         3.787879
9                                           Dan Brown         3.754540
10                                         Lois Lowry         3.750000
11            George Orwell/Boris Grabnar/Peter Škerl         3.729730
12                                    Stephenie Meyer         3.662500
13                                     John Steinbeck         3.622951

### Cреднее количество обзоров от пользователей, которые поставили больше 50 оценок

In [17]:
query = '''
            SELECT
                AVG(sub_review_cnt.review_cnt) AS avg_review_cnt
            FROM
                (SELECT
                    COUNT(text) AS review_cnt
                FROM
                    reviews
                WHERE
                    username IN
                        (SELECT
                            username
                        FROM
                            ratings
                        GROUP BY
                            username
                        HAVING
                            COUNT(ratings) > 50)
                        GROUP BY
                               username) AS sub_review_cnt
        '''

In [18]:
pd.io.sql.read_sql(query, con = engine)

   avg_review_cnt
0       24.333333

## Выводы

- После 01-01-2000 вышло 819 книг
- Больше всего обзоров (7) написано на книгу Twilight
- Издательство, которое выпустило наибольшее число книг толще 50 страниц, это Penguin Books с 42 книгами (исключая брошюры)
- Автор с самой высокой средней оценкой книг - это J.K. Rowling/Mary GrandPré со средним рейтингом 4.28
- Cреднее количество обзоров от пользователей, которые поставили больше 50 оценок - 24.3